htdocs/basic3/_protected/controllers/CoachInfoController.php

SELECT * FROM `coach_info` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = CoachInfo::findOne($id)) !== null) {