htdocs/basic3/_protected/controllers/CoachInfoController.php

    public function actionCreate()
    {
        $model = new CoachInfo();

		 $model->user_id = Yii::$app->user->id;

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `coach_info` (`user_id`, `first_name`, `last_name`, `cell_number`, `home_number`, `coach_notes`, `coach_email`) VALUES (1, 'Bobby', 'Boucher', '7858421212', '7858421212', 'warter bor', 'bobbyboucher')

    protected function findModel($id)
    {
        if (($model = CoachInfo::findOne($id)) !== null) {
---
SELECT * FROM `coach_info` WHERE `id`='2'