htdocs/basic3/_protected/controllers/CourseInfoController.php

SELECT * FROM `course_info` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = CourseInfo::findOne($id)) !== null) {