htdocs/basic3/_protected/controllers/FormatInfoController.php

SELECT * FROM `format_info` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = FormatInfo::findOne($id)) !== null) {