htdocs/basic3/_protected/controllers/LeagueInfoController.php

    protected function findModel($id)
    {
        if (($model = LeagueInfo::findOne($id)) !== null) {
---
SELECT * FROM `league_info` WHERE `id`='1'