htdocs/basic3/_protected/controllers/LeagueSeasonController.php

    protected function findModel($id)
    {
        if (($model = LeagueSeason::findOne($id)) !== null) {
---
SELECT * FROM `league_season` WHERE `id`='2'