htdocs/basic3/_protected/controllers/TeamSeasonController.php

    protected function findModel($id)
    {
        if (($model = TeamSeason::findOne($id)) !== null) {
---
SELECT * FROM `team_season` WHERE `id`='2'